StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
/*
 * Pressure-pad ADC threshold.
 *
 * Set this to the calibrated ADC value that represents "pressure detected".
 * The current implementation assumes pressure is detected when ADC >= threshold.
 */
#define PRESSURE_SETUP_MIN_THRESHOLD    300

/*
 * The existing hall_sensor.c/h in the supplied project exposes one
 * hall_sensor_measurement_get() API. Therefore the two setup/operating
 * hall checkpoints are kept as separate application-level functions below.
 *
 * Replace the two functions with the actual Hall Sensor 1 / Hall Sensor 2
 * channel APIs when those are available.
 */
#define HALL_DUTY_MIN_PER_MILLE           100U
#define HALL_DUTY_MAX_PER_MILLE           900U

/* MC3635 limits. Tune these with the installed-product measurements. */
#define ACCEL_X_MIN_MG                    (-2000)
#define ACCEL_X_MAX_MG                    (2000)
#define ACCEL_Y_MIN_MG                    (-2000)
#define ACCEL_Y_MAX_MG                    (2000)
#define ACCEL_Z_MIN_MG                    (-2000)
#define ACCEL_Z_MAX_MG                    (2000)

/* Setup/wake switch. The Nordic BSP board definition supplies BUTTON_1. */
#define SETUP_SWITCH_PIN                  BUTTON_1
#define SETUP_SWITCH_ACTIVE_LEVEL         0

/* =========================================================
 * Timers
 * ========================================================= */
APP_TIMER_DEF(m_boot_window_timer);
APP_TIMER_DEF(m_setup_timeout_timer);
APP_TIMER_DEF(m_switch_sample_timer);
APP_TIMER_DEF(m_setup_sensor_timer);
APP_TIMER_DEF(m_monitoring_timer);

/* =========================================================
 * Application States
 * ========================================================= */
typedef enum
{
    APP_STATE_BOOT_CHECK,
    APP_STATE_SETUP,
    APP_STATE_OPERATING_SLEEP,
    APP_STATE_OPERATING_MONITORING,
    APP_STATE_BUZZER

} app_state_t;

typedef enum
{
    SETUP_STEP_HALL_1,
    SETUP_STEP_HALL_2,
    SETUP_STEP_PRESSURE,
    SETUP_STEP_COMPLETE

} setup_step_t;

typedef enum
{
    BUZZER_REASON_SETUP_TIMEOUT,
    BUZZER_REASON_OPERATING_FAILURE

} buzzer_reason_t;

/* =========================================================
 * Application Variables
 * ========================================================= */
static volatile bool m_boot_window_timeout;
static volatile bool m_setup_timeout;
static volatile bool m_switch_sample_timeout;
static volatile bool m_setup_sensor_timeout;
static volatile bool m_monitoring_timeout;

static uint16_t m_switch_hold_ms;
static setup_step_t m_setup_step = SETUP_STEP_HALL_1;
static buzzer_reason_t m_buzzer_reason;
static app_state_t m_app_state = APP_STATE_BOOT_CHECK;
static int16_t m_pressure_threshold = 0;

static TWI_parameters_t m_mc3635 =
{
    .SDA  = I2C_SDA_PIN,
    .SCL  = I2C_SCL_PIN,
    .ADDR = MC3635_ADDRESS_HIGH,
};

static bool m_accelerometer_ready;

/* =========================================================
 * Timer Handlers
 * ========================================================= */
static void boot_window_timer_handler(void * p_context)
{
    (void)p_context;
    m_boot_window_timeout = true;
}

static void setup_timeout_timer_handler(void * p_context)
{
    (void)p_context;
    m_setup_timeout = true;
}

static void switch_sample_timer_handler(void * p_context)
{
    (void)p_context;
    m_switch_sample_timeout = true;
}

static void setup_sensor_timer_handler(void * p_context)
{
    (void)p_context;
    m_setup_sensor_timeout = true;
}

static void monitoring_timer_handler(void * p_context)
{
    (void)p_context;
    m_monitoring_timeout = true;
}

/* =========================================================
 * Setup/Wake Switch
 * ========================================================= */
static bool setup_switch_is_pressed(void)
{
    return (nrf_gpio_pin_read(SETUP_SWITCH_PIN) == SETUP_SWITCH_ACTIVE_LEVEL);
}

static void setup_switch_init(void)
{
    nrf_gpio_cfg_input(SETUP_SWITCH_PIN, NRF_GPIO_PIN_PULLUP);
}

/*
 * Returns true only after the switch has been continuously held for 5 s.
 * The counter is intentionally reset when the switch is released.
 */
static bool setup_switch_held_for_5s(void)
{
    if (setup_switch_is_pressed())
    {
        if (m_switch_hold_ms < SWITCH_HOLD_TIME_MS)
        {
            m_switch_hold_ms += SWITCH_SAMPLE_PERIOD_MS;
        }

        if (m_switch_hold_ms >= SWITCH_HOLD_TIME_MS)
        {
            return true;
        }
    }
    else
    {
        m_switch_hold_ms = 0;
    }

    return false;
}

static void setup_switch_hold_reset(void)
{
    m_switch_hold_ms = 0;
}

/* =========================================================
 * Buzzer
 * =========================================================
 *
 * IMPORTANT:
 * The supplied main.c does not contain a real buzzer-driver API.
 * The existing project used LED_1 as a buzzer placeholder.
 *
 * Keep these functions as the single integration point for the real
 * buzzer driver.
 */
static void buzzer_enable(void)
{
    NRF_LOG_INFO("BUZZER: ON");

    /* TODO: Replace with real buzzer driver enable. */
    bsp_board_led_on(0);
}

static void buzzer_disable(void)
{
    NRF_LOG_INFO("BUZZER: OFF");

    /* TODO: Replace with real buzzer driver disable. */
    bsp_board_led_off(0);
}

/*
 * Setup confirmation: three short beeps.
 *
 * Replace the LED timing with the real buzzer driver once available.
 */
static void buzzer_beep_3_times(void)
{
    NRF_LOG_INFO("BUZZER: 3 beeps");

    for (uint8_t i = 0; i < 3; i++)
    {
        buzzer_enable();
        nrf_delay_ms(150);
        buzzer_disable();

        if (i < 2)
        {
            nrf_delay_ms(150);
        }
    }
}

/* =========================================================
 * Hall Sensor
 * ========================================================= */

/*
 * Existing Hall API from the supplied main.c.
 *
 * This is the current generic Hall check. It should be replaced with
 * Hall Sensor 1 and Hall Sensor 2 specific checks when the Hall driver
 * exposes two independent channels.
 */
static bool hall_sensor_is_valid(void)
{
    /*
     * IMPORTANT:
     * The supplied main.c currently has the real Hall measurement code
     * disabled and returns true. Keep the same behavior here so this file
     * remains compatible with the current hall_sensor module.
     *
     * Replace this function with the real Hall detection implementation.
     */
#if 0
    hall_sensor_measurement_t measurement;

    if (!hall_sensor_measurement_get(&measurement))
    {
        NRF_LOG_WARNING("No complete Hall PWM sample.");
        return false;
    }

