StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
    NRF_LOG_INFO("Hall PWM: %u.%u%%, period: %u ticks",
                 measurement.duty_per_mille / 10U,
                 measurement.duty_per_mille % 10U,
                 measurement.period_ticks);

    return (measurement.duty_per_mille >= HALL_DUTY_MIN_PER_MILLE) &&
           (measurement.duty_per_mille <= HALL_DUTY_MAX_PER_MILLE);
#endif
    return true;
}

/*
 * Application-level Hall Sensor 1 checkpoint.
 * TODO: connect to Hall Sensor 1 driver/channel.
 */
static bool hall_sensor_1_detected(void)
{
    return hall_sensor_is_valid();
}

/*
 * Application-level Hall Sensor 2 checkpoint.
 * TODO: connect to Hall Sensor 2 driver/channel.
 */
static bool hall_sensor_2_detected(void)
{
    return hall_sensor_is_valid();
}

/* =========================================================
 * Pressure Pad
 * ========================================================= */
static bool setup_pressure_detected(void)
{
    int16_t pressure = pressure_pad_adc_read();

    NRF_LOG_INFO("Setup pressure ADC: %d", pressure);

    if (pressure >= PRESSURE_SETUP_MIN_THRESHOLD)
    {
        /*
         * Record the pressure detected during installation.
         * This becomes the operating-mode threshold.
         */
        m_pressure_threshold = pressure;

        NRF_LOG_INFO("Pressure threshold calibrated: %d",
                     m_pressure_threshold);

        return true;
    }

    return false;
}


static bool pressure_pad_is_valid(void)
{
    int16_t pressure = pressure_pad_adc_read();

    NRF_LOG_INFO("Operating pressure ADC: %d", pressure);

    if (pressure < m_pressure_threshold)
    {
        NRF_LOG_WARNING(
            "Pressure failure: %d < threshold %d",
            pressure,
            m_pressure_threshold);

        return false;
    }

    return true;
}

/* =========================================================
 * Accelerometer
 * ========================================================= */
static bool accelerometer_init(void)
{
    if (MC3635_Init(&m_mc3635) != MC3635_SUCCESS)
        return false;

    if (MC3635_SetStandbyMode(&m_mc3635) != MC3635_SUCCESS ||
        MC3635_InitializationSequence(&m_mc3635) != MC3635_SUCCESS ||
        MC3635_EnableAxis(&m_mc3635,
                          MODE_C_X_AXIS_PD_ENABLED,
                          MODE_C_Y_AXIS_PD_ENABLED,
                          MODE_C_Z_AXIS_PD_ENABLED) != MC3635_SUCCESS ||
        MC3635_SetResolution(&m_mc3635, RANGE_C_RES_12_BITS) != MC3635_SUCCESS ||
        MC3635_SetRange(&m_mc3635, RANGE_C_RANGE_2G) != MC3635_SUCCESS ||
        MC3635_EnableFIFO(&m_mc3635, FIFO_C_FIFO_EN_DISABLED) != MC3635_SUCCESS)
    {
        return false;
    }

    return MC3635_SetSleepMode(&m_mc3635) == MC3635_SUCCESS;
}

static bool accelerometer_is_valid(void)
{
    MC3635_data_t accel;
    MC3635_data_t status;
    bool valid = false;

    if (!m_accelerometer_ready)
    {
        NRF_LOG_ERROR("MC3635 is not initialized.");
        return false;
    }

    if (MC3635_SetStandbyMode(&m_mc3635) != MC3635_SUCCESS ||
        MC3635_SetMode(&m_mc3635,
                       MODE_C_MCTRL_CWAKE,
                       LOW_POWER_MODE,
                       ODR_6) != MC3635_SUCCESS)
    {
        NRF_LOG_ERROR("MC3635 wake failed.");
        return false;
    }

    do
    {
        if (MC3635_ReadStatusRegister1(&m_mc3635, &status) != MC3635_SUCCESS)
        {
            NRF_LOG_ERROR("MC3635 status read failed.");
            goto sleep_sensor;
        }
    } while ((status.status_1 & STATUS_1_NEW_DATA_MASK) == 0);

    if (MC3635_ReadRawData(&m_mc3635, &accel) != MC3635_SUCCESS)
    {
        NRF_LOG_ERROR("MC3635 read failed.");
        goto sleep_sensor;
    }

    NRF_LOG_INFO("Accel: X=%d mg, Y=%d mg, Z=%d mg",
                 accel.XAxis_mg,
                 accel.YAxis_mg,
                 accel.ZAxis_mg);

    valid =
        (accel.XAxis_mg >= ACCEL_X_MIN_MG) &&
        (accel.XAxis_mg <= ACCEL_X_MAX_MG) &&
        (accel.YAxis_mg >= ACCEL_Y_MIN_MG) &&
        (accel.YAxis_mg <= ACCEL_Y_MAX_MG) &&
        (accel.ZAxis_mg >= ACCEL_Z_MIN_MG) &&
        (accel.ZAxis_mg <= ACCEL_Z_MAX_MG);

sleep_sensor:
    if (MC3635_SetSleepMode(&m_mc3635) != MC3635_SUCCESS)
    {
        NRF_LOG_ERROR("MC3635 sleep failed.");
    }

    return valid;

}



/* =========================================================
 * State Helpers
 * ========================================================= */
static void monitoring_timer_stop(void)
{
    (void)app_timer_stop(m_monitoring_timer);
    m_monitoring_timeout = false;
}

static void enter_operating_mode(void)
{
    NRF_LOG_INFO("SETUP COMPLETE -> OPERATING MODE");

    buzzer_disable();
    (void)app_timer_stop(m_setup_timeout_timer);
    (void)app_timer_stop(m_setup_sensor_timer);
    m_setup_timeout = false;
    m_setup_sensor_timeout = false;
    monitoring_timer_stop();

    m_monitoring_timeout = false;
    APP_ERROR_CHECK(
        app_timer_start(
            m_monitoring_timer,
            APP_TIMER_TICKS(MONITORING_PERIOD_MS),
            NULL
        )
    );

    /*
     * First operating-mode check starts after 10 seconds.
     */
    m_app_state = APP_STATE_OPERATING_SLEEP;
}

static void start_setup_mode(void)
{
    NRF_LOG_INFO("========== ENTER SETUP MODE ==========");

    buzzer_disable();
    setup_switch_hold_reset();

    (void)app_timer_stop(m_boot_window_timer);
    (void)app_timer_stop(m_monitoring_timer);
    (void)app_timer_stop(m_setup_sensor_timer);
    m_monitoring_timeout = false;
    m_setup_sensor_timeout = false;

    m_setup_step = SETUP_STEP_HALL_1;
    m_setup_timeout = false;

    m_app_state = APP_STATE_SETUP;

    APP_ERROR_CHECK(
        app_timer_start(
            m_setup_timeout_timer,
            APP_TIMER_TICKS(SETUP_TIMEOUT_MS),
            NULL
        )
    );

    APP_ERROR_CHECK(
        app_timer_start(
            m_setup_sensor_timer,
            APP_TIMER_TICKS(SWITCH_SAMPLE_PERIOD_MS),
            NULL
        )
    );

    NRF_LOG_INFO("SETUP: waiting for HALL SENSOR 1");
}

static void setup_mode_timeout(void)
{
    NRF_LOG_WARNING("SETUP FAILED: 60 second timeout");

    (void)app_timer_stop(m_setup_timeout_timer);
    (void)app_timer_stop(m_setup_sensor_timer);
    m_setup_sensor_timeout = false;

    m_buzzer_reason = BUZZER_REASON_SETUP_TIMEOUT;
    m_app_state = APP_STATE_BUZZER;

    buzzer_enable();
}

static void process_setup_step(void)
{
    switch (m_setup_step)
    {
        case SETUP_STEP_HALL_1:
            if (hall_sensor_1_detected())
            {
                NRF_LOG_INFO("SETUP: HALL SENSOR 1 detected");
                buzzer_beep_3_times();

                m_setup_step = SETUP_STEP_HALL_2;
                NRF_LOG_INFO("SETUP: waiting for HALL SENSOR 2");
            }
            break;

        case SETUP_STEP_HALL_2:
            if (hall_sensor_2_detected())
            {
                NRF_LOG_INFO("SETUP: HALL SENSOR 2 detected");
                buzzer_beep_3_times();

                m_setup_step = SETUP_STEP_PRESSURE;
                NRF_LOG_INFO("SETUP: waiting for PRESSURE PAD");
            }
            break;

        case SETUP_STEP_PRESSURE:
            if (setup_pressure_detected())
            {
                NRF_LOG_INFO("SETUP: PRESSURE PAD detected");
                buzzer_beep_3_times();

                m_setup_step = SETUP_STEP_COMPLETE;
                (void)app_timer_stop(m_setup_timeout_timer);
                (void)app_timer_stop(m_setup_sensor_timer);
                m_setup_sensor_timeout = false;

                enter_operating_mode();
            }
            break;

        case SETUP_STEP_COMPLETE:
        default:
            break;
    }
}

