StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
static void enter_operating_sleep(void)
{
    /*
     * "Sleep" here means the normal nRF power-management idle state.
     * The monitoring timer remains active and wakes the MCU every 10 s.
     */
    m_app_state = APP_STATE_OPERATING_SLEEP;
}

static void start_monitoring_cycle(void)
{
    NRF_LOG_INFO("========== OPERATING CHECK ==========");

    bool hall1_ok = hall_sensor_1_detected();
    bool hall2_ok = hall_sensor_2_detected();
    bool accel_ok = accelerometer_is_valid();
    bool pressure_ok = pressure_pad_is_valid();

    NRF_LOG_INFO("Operating check:\r\n H1_OK=%d H2_OK=%d ACCL_OK=%d PRESSURE_OK=%d",
                 hall1_ok,
                 hall2_ok,
                 accel_ok,
                 pressure_ok);

    /*
     * All operating conditions must be valid.
     * If any condition fails, the buzzer remains continuously ON.
     */
    if (hall1_ok && hall2_ok && accel_ok && pressure_ok)
    {
        NRF_LOG_INFO("All operating conditions are OK.");

        buzzer_disable();
        enter_operating_sleep();
    }
    else
    {
        NRF_LOG_WARNING("Operating threshold failed.");

        m_buzzer_reason = BUZZER_REASON_OPERATING_FAILURE;
        m_app_state = APP_STATE_BUZZER;

        buzzer_enable();
    }
}

/*
 * Called from APP_STATE_BUZZER.
 *
 * A 5-second button hold:
 *   - turns the buzzer OFF
 *   - restarts setup mode
 */
static void process_buzzer_state(void)
{
    if (m_switch_sample_timeout)
    {
        m_switch_sample_timeout = false;

        if (setup_switch_held_for_5s())
        {
            NRF_LOG_INFO("5-second button hold detected.");
            NRF_LOG_INFO("Restarting SETUP MODE and turning buzzer OFF.");

            buzzer_disable();
            setup_switch_hold_reset();

            start_setup_mode();
        }
    }
}

/* =========================================================
 * Timers Initialization
 * ========================================================= */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    APP_ERROR_CHECK(
        app_timer_create(
            &m_boot_window_timer,
            APP_TIMER_MODE_SINGLE_SHOT,
            boot_window_timer_handler
        )
    );

    APP_ERROR_CHECK(
        app_timer_create(
            &m_setup_timeout_timer,
            APP_TIMER_MODE_SINGLE_SHOT,
            setup_timeout_timer_handler
        )
    );

    APP_ERROR_CHECK(
        app_timer_create(
            &m_switch_sample_timer,
            APP_TIMER_MODE_REPEATED,
            switch_sample_timer_handler
        )
    );

    APP_ERROR_CHECK(
        app_timer_create(
            &m_setup_sensor_timer,
            APP_TIMER_MODE_REPEATED,
            setup_sensor_timer_handler
        )
    );

    APP_ERROR_CHECK(
        app_timer_create(
            &m_monitoring_timer,
            APP_TIMER_MODE_REPEATED,
            monitoring_timer_handler
        )
    );
}

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}




/**@brief Function starting the internal LFCLK oscillator.
 *
 * @details This is needed by RTC1 which is used by the Application Timer
 *          (When SoftDevice is enabled the LFCLK is always running and this is not needed).
 */
static void lfclk_request(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
    nrf_drv_clock_lfclk_request(NULL);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }
    }

