StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    //uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    uint32_t err_code = bsp_init(BSP_INIT_LEDS , bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).


 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.



/**@brief Application main function. */
int main(void)
{
    bool erase_bonds;

    /* ---------------------------------------------------------
     * Basic / Nordic initialization
     * --------------------------------------------------------- */
    uart_init();
    log_init();
    lfclk_request();
    timers_init();

    buttons_leds_init(&erase_bonds);
    power_management_init();

    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
#if 1
    /*
     * The pressure pad is now ADC based.
     * There is no GPIO interrupt for the pressure pad anymore.
     */
    APP_ERROR_CHECK(pressure_pad_adc_init());

    APP_ERROR_CHECK(hall_sensor_init());

    /*
     * MC3635 is required by Operating Mode.
     */
    m_accelerometer_ready = accelerometer_init();

    if (m_accelerometer_ready)
    {
        NRF_LOG_INFO("MC3635 initialized.");
    }
    else
    {
        NRF_LOG_ERROR("MC3635 initialization failed.");
    }
#endif
    /*
     * Setup/Wake switch is used for:
     *   1. Entering Setup Mode after a 5 s hold at boot.
     *   2. Restarting Setup Mode after a failure.
     */
    setup_switch_init();

    /*
     * Switch sampling is kept active while the application is running.
     *
     * IMPORTANT: this timer is ONLY for the setup/wake button.
     * Sensor polling in Setup Mode uses m_setup_sensor_timer.
     */
    APP_ERROR_CHECK(
        app_timer_start(
            m_switch_sample_timer,
            APP_TIMER_TICKS(SWITCH_SAMPLE_PERIOD_MS),
            NULL
        )
    );

    /*
     * At boot the application waits up to 30 s for the setup switch.
     *
     * If the switch is held continuously for 5 s:
     *      -> Setup Mode
     *
     * If there is no setup activity for 30 s:
     *      -> System OFF / sleep
     */
    m_app_state = APP_STATE_BOOT_CHECK;
    m_boot_window_timeout = false;
    setup_switch_hold_reset();

    APP_ERROR_CHECK(
        app_timer_start(
            m_boot_window_timer,
            APP_TIMER_TICKS(BOOT_SETUP_WINDOW_MS),
            NULL
        )
    );

    advertising_start();

    NRF_LOG_INFO("==========================================");
    NRF_LOG_INFO("Nordic Safety Buckle Application");
    NRF_LOG_INFO("Application: Setup + Operating Mode");
    NRF_LOG_INFO("==========================================");

    /* ---------------------------------------------------------
     * Main application loop
     * --------------------------------------------------------- */
    for (;;)
    {
        switch (m_app_state)
        {
            /* =================================================
             * BOOT CHECK
             *
             * After boot/restart:
             *   - Watch the setup/wake switch for 30 s.
             *   - 5 s hold -> Setup Mode.
             *   - No activity for 30 s -> System OFF.
             * ================================================= */
            case APP_STATE_BOOT_CHECK:
            {
                if (m_switch_sample_timeout)
                {
                    m_switch_sample_timeout = false;

                    if (setup_switch_held_for_5s())
                    {
                        NRF_LOG_INFO("5-second switch hold detected at boot.");

                        (void)app_timer_stop(m_boot_window_timer);
                        setup_switch_hold_reset();

                        start_setup_mode();
                    }
                }

                if (m_boot_window_timeout)
                {
                    m_boot_window_timeout = false;

                    NRF_LOG_INFO(
                        "No setup switch activity for 30 s. Entering sleep."
                    );

