StrawHat-MonkeyDLuffy/nordic-safety-buckle/nRF5_SDK_17.1.0_ddde560/examples/My_project/ble_app_uart/main.c
                    /*
                     * System OFF wakes through the configured BSP wake button.
                     * Wake-up causes a reset, after which the 30 s boot check
                     * is performed again.
                     */
                    sleep_mode_enter();
                }

                break;
            }

            /* =================================================
             * SETUP MODE
             *
             * Required order:
             *
             *   1. Hall Sensor 1 -> 3 beeps
             *   2. Hall Sensor 2 -> 3 beeps
             *   3. Pressure Pad -> 3 beeps
             *
             * All three detections must complete within 60 s.
             * ================================================= */
            case APP_STATE_SETUP:
            {
                /*
                 * The switch timer is ONLY for button sampling.
                 * It must not be used to check Hall sensors or the
                 * pressure pad.
                 */
                if (m_switch_sample_timeout)
                {
                    m_switch_sample_timeout = false;
                    setup_switch_hold_reset();
                }

                /*
                 * The setup sensor timer independently polls the
                 * currently expected sensor every 100 ms.
                 *
                 * Example:
                 *   HALL_1 detected -> move to HALL_2
                 *   HALL_2 not detected -> remain in HALL_2
                 *   HALL_2 detected at 40 s -> immediately move to PRESSURE
                 */
                if (m_setup_sensor_timeout)
                {
                    m_setup_sensor_timeout = false;
                    process_setup_step();
                }

                /*
                 * The 60-second setup timer is independent of sensor
                 * polling. It limits the COMPLETE sequence, not each
                 * individual sensor.
                 */
                if (m_setup_timeout)
                {
                    m_setup_timeout = false;

                    if (m_setup_step != SETUP_STEP_COMPLETE)
                    {
                        setup_mode_timeout();
                    }
                }

                break;
            }

            /* =================================================
             * OPERATING SLEEP
             *
             * "Sleep" here is normal nRF idle/power-management sleep.
             * The 10 s monitoring timer remains active.
             * ================================================= */
            case APP_STATE_OPERATING_SLEEP:
            {
                if (m_monitoring_timeout)
                {
                    m_monitoring_timeout = false;

                    m_app_state = APP_STATE_OPERATING_MONITORING;
                }

                break;
            }

            /* =================================================
             * OPERATING MONITORING
             *
             * Every 10 s check:
             *
             *   - Hall Sensor 1
             *   - Hall Sensor 2
             *   - Accelerometer
             *   - Pressure pad released
             *
             * If ALL conditions are valid:
             *      -> Sleep for the next 10 s
             *
             * If ANY condition fails:
             *      -> Continuous buzzer
             * ================================================= */
            case APP_STATE_OPERATING_MONITORING:
            {
                start_monitoring_cycle();
                break;
            }

            /* =================================================
             * BUZZER
             *
             * Failure in Setup Mode:
             *      -> buzzer remains ON
             *      -> user holds switch for 5 s
             *      -> buzzer OFF
             *      -> Setup Mode restarts
             *
             * Failure in Operating Mode:
             *      -> same recovery action
             * ================================================= */
            case APP_STATE_BUZZER:
            {
                process_buzzer_state();
                break;
            }

            /* =================================================
             * DEFAULT
             * ================================================= */
            default:
            {
                NRF_LOG_ERROR(
                    "Invalid application state: %d",
                    m_app_state
                );

                buzzer_disable();
                m_app_state = APP_STATE_BOOT_CHECK;
                break;
            }
        }

        idle_state_handle();
    }
}


/**
 * @}
 */
